Revit 2026 API

# CurtainGridSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurtainGridSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
CurtainGridSetIterator()
```
```fsharp
new : unit -> CurtainGridSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CurtainGridSetIterator Class

Autodesk.Revit.DB Namespace